Бух_для_edt.РасширениеСмарт_БП_РФ/src/InformationRegisters/СтатусыДокументов/СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="2bbc663f-0d55-4046-83fa-a096b2dd61bb">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d395333a-d25a-4b82-8443-bf28be68adda">
    <name>НомерСчетаФактуры</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="46a0c67c-b615-48bd-97dd-ce4e55d1fc53">
    <name>СтатусСчетаФактуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="554e5f1b-3970-427a-bdcb-48f132b61731">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="5e58adad-58c7-4928-96cc-e666fae6e57b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Бух_для_edt.РасширениеСмарт_БП_РФ/src/InformationRegisters/СтатусыДокументов/ManagerModule.bsl
#Область ПеренесеноСДоработкамиСмарт
	
&Вместо("УстановитьСтатусыДокументов")
Функция РасшСмарт_УстановитьСтатусыДокументов(МассивДокументов, СтатусыДокумента)
	
	СтатусИзменен = Ложь;
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат СтатусИзменен;
	КонецЕсли;
	
	ИзменитьСтатус = (СтатусыДокумента.Статус <> Неопределено);
	ИзменитьДополнительныйСтатус = (СтатусыДокумента.ДополнительныйСтатус <> Неопределено);
	ИзменитьСтатусСчетаФактуры   = (СтатусыДокумента.СтатусСФ <> Неопределено);
	ИзменитьСтатусОригиналаСФ = (СтатусыДокумента.СтатусОригиналаСФ <> Неопределено);
	ИзменитьНомерСчетаФактуры = (СтатусыДокумента.НомерСчетаФактуры <> "");
	ИзменитьСтатусЧекаНПД = СтатусыДокумента.СтатусЧекаНПД <> Неопределено;
	
	Если Не ИзменитьСтатус 
		И Не ИзменитьДополнительныйСтатус 
		И Не ИзменитьСтатусСчетаФактуры
		И Не ИзменитьСтатусОригиналаСФ 
		И Не ИзменитьНомерСчетаФактуры
		И Не ИзменитьСтатусЧекаНПД Тогда
		Возврат СтатусИзменен;
	КонецЕсли;
	
	СтатусыПоУмолчанию = СтатусНовогоДокумента(МассивДокументов[0]);
	
	// Убедимся, что документ поддерживает установку статусов (должен быть определен статус по умолчанию).
	Если СтатусыПоУмолчанию.Статус = Неопределено Тогда
		Возврат СтатусИзменен;
	КонецЕсли;
	
	МетаданныеДокумента = МассивДокументов[0].Метаданные();
	// Фролов+
	//ВыполнитьПроверкуПравДоступа("Редактирование", МетаданныеДокумента);
	Если Не РольДоступна("смартИзменениеДокументПодписан") Тогда 
		ВыполнитьПроверкуПравДоступа("Редактирование", МетаданныеДокумента);
	КонецЕсли;	
	// Фролов-
	
	ИмяДокумента = МетаданныеДокумента.Имя;
	
	ВремяНачалаОперации = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("СтатусОплатыПоУмолчанию", СтатусыПоУмолчанию.Статус);
	Запрос.УстановитьПараметр("ДополнительныйСтатусПоУмолчанию", СтатусыПоУмолчанию.ДополнительныйСтатус);
	Запрос.УстановитьПараметр("СтатусСчетаФактурыПоУмолчанию", Перечисления.СтатусыСчетаФактуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтатусОригиналаСФПоУмолчанию", СтатусыПоУмолчанию.Статус);
	Запрос.УстановитьПараметр("НомерСчетаФактурыПоУмолчанию", "");
	Запрос.УстановитьПараметр("СтатусЧекаНПДПоУмолчанию", СтатусыПоУмолчанию.СтатусЧекаНПД);
	
	ТекстЗапроса = // Имя таблицы с документами может быть заменено ниже
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокументов.Организация КАК Организация,
	|	ТаблицаДокументов.Ссылка КАК Документ,
	|	ЕСТЬNULL(СтатусыДокументов.Статус, &СтатусОплатыПоУмолчанию) КАК Статус,
	|	ЕСТЬNULL(СтатусыДокументов.ДополнительныйСтатус, &ДополнительныйСтатусПоУмолчанию) КАК ДополнительныйСтатус,
	|	ЕСТЬNULL(СтатусыДокументов.СтатусСчетаФактуры, &СтатусСчетаФактурыПоУмолчанию) КАК СтатусСчетаФактуры,
	|	ЕСТЬNULL(СтатусыДокументов.СтатусОригиналаСчетаФактуры, &СтатусОригиналаСФПоУмолчанию) КАК СтатусОригиналаСчетаФактуры,
	|	ЕСТЬNULL(СтатусыДокументов.НомерСчетаФактуры, &НомерСчетаФактурыПоУмолчанию) КАК НомерСчетаФактуры,
	|	ЕСТЬNULL(СтатусыДокументов.СтатусЧекаНПД, &СтатусЧекаНПДПоУмолчанию) КАК СтатусЧекаНПД
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументов КАК СтатусыДокументов
	|		ПО ТаблицаДокументов.Организация = СтатусыДокументов.Организация
	|			И ТаблицаДокументов.Ссылка = СтатусыДокументов.Документ
	|ГДЕ
	|	ТаблицаДокументов.Ссылка В(&МассивДокументов)";
	
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "СчетНаОплатуПокупателю", ИмяДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если (Не ИзменитьСтатус Или Выборка.Статус = СтатусыДокумента.Статус)
			И (Не ИзменитьДополнительныйСтатус Или Выборка.ДополнительныйСтатус = СтатусыДокумента.ДополнительныйСтатус)
			И (Не ИзменитьСтатусСчетаФактуры Или Выборка.СтатусСчетаФактуры = СтатусыДокумента.СтатусСФ) 
			И (Не ИзменитьСтатусОригиналаСФ Или Выборка.СтатусОригиналаСчетаФактуры = СтатусыДокумента.СтатусОригиналаСФ)
			И (Не ИзменитьНомерСчетаФактуры Или Выборка.НомерСчетаФактуры = СтатусыДокумента.НомерСчетаФактуры)
			И (Не ИзменитьСтатусЧекаНПД Или Выборка.СтатусЧекаНПД = СтатусыДокумента.СтатусЧекаНПД) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Выборка.Документ) = Тип("ДокументСсылка.ВыплатыСамозанятым") 
			И Выборка.Статус = Перечисления.СтатусыДокументовВыплатыСамозанятым.Отклонено Тогда
			// Если документ ВыплатыСамозанятым Отклонен, то другие статусы ему уже нельзя присваивать
			Продолжить;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Если ИнтеграцияCRMПовтИсп.ИнтеграцияВИнформационнойБазеВключена()
			И (Выборка.Статус <> СтатусыДокумента.Статус 
				ИЛИ Выборка.ДополнительныйСтатус <> СтатусыДокумента.ДополнительныйСтатус) Тогда
			РегистрыСведений.ДокументыИнтеграцииCRM.ЗарегистрироватьКОтправке(Выборка.Документ);
		КонецЕсли;
		
		// При записи набора, удаляем статусы, относящиеся к другой организации
		НаборЗаписей = РегистрыСведений.СтатусыДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Документ);
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Если ИзменитьСтатус Тогда
			Запись.Статус = СтатусыДокумента.Статус;
		КонецЕсли;
		Если ИзменитьДополнительныйСтатус Тогда
			Запись.ДополнительныйСтатус = СтатусыДокумента.ДополнительныйСтатус;
		КонецЕсли;
		Если ИзменитьСтатусСчетаФактуры Тогда
			Запись.СтатусСчетаФактуры = СтатусыДокумента.СтатусСФ;
		КонецЕсли;
		// Реквизит "СтатусОригиналаСчетаФактуры" необходим для оптимизации открытия списков документов, 
		// в которых дополнительно отображается статус счета-фактуры, например в списке "Поступления (акты, накладные, УПД)"
		Если ИзменитьСтатусОригиналаСФ Тогда
			Запись.СтатусОригиналаСчетаФактуры = СтатусыДокумента.СтатусОригиналаСФ;
		КонецЕсли;
		
		Если ИзменитьНомерСчетаФактуры Тогда
			Запись.НомерСчетаФактуры = СтатусыДокумента.НомерСчетаФактуры;
		КонецЕсли;
		
		Если ИзменитьСтатусЧекаНПД Тогда
			Запись.СтатусЧекаНПД = СтатусыДокумента.СтатусЧекаНПД;
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
		УстановитьПривилегированныйРежим(Ложь);
		
		СтатусИзменен = Истина;
		
	КонецЦикла;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени(
		"УстановкаСтатуса",
		ВремяНачалаОперации,
		МассивДокументов.Количество(),
		Строка(ТипЗнч(МассивДокументов[0])));
	
	Возврат СтатусИзменен;
	
КонецФункции

#КонецОбласти
